os2web_acadre_arp/test_data/request-12.soap.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Publish xmlns="http://Acadre.Publishing.CMS.PublishingHandler.Demo"><info><ItemId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">0ad6f8db-04a1-44d7-b561-f42aa8c6858b</ItemId><LocationId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">default</LocationId><Metadata xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">&lt;?xml version="1.0" encoding="utf-16"?&gt;
&lt;PublishedCase xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.traen.com/2007/20/07/"&gt;
  &lt;AdministrativeUnit&gt;
    &lt;AdministrativeUnitGUID&gt;127f4700-88d7-48a0-b285-6d2271ec9694&lt;/AdministrativeUnitGUID&gt;
    &lt;AdministrativeUnitName&gt;Test enhed&lt;/AdministrativeUnitName&gt;
  &lt;/AdministrativeUnit&gt;
  &lt;Title&gt;Test af publicering&lt;/Title&gt;
  &lt;CaseContent&gt;En sag med 2 dokumenter og 2 notater&lt;/CaseContent&gt;
  &lt;Year&gt;2012&lt;/Year&gt;
  &lt;SequenceNumber&gt;14394&lt;/SequenceNumber&gt;
  &lt;CreationDate&gt;2012-06-19&lt;/CreationDate&gt;
  &lt;LastModificationDate&gt;2012-06-19&lt;/LastModificationDate&gt;
  &lt;CaseType&gt;EMSAG&lt;/CaseType&gt;
  &lt;Status&gt;B&lt;/Status&gt;
  &lt;CaseResponsibleUser&gt;
    &lt;UserInitials&gt;acadre&lt;/UserInitials&gt;
    &lt;UserName&gt;acadre&lt;/UserName&gt;
  &lt;/CaseResponsibleUser&gt;
  &lt;IsPaperBased&gt;false&lt;/IsPaperBased&gt;
  &lt;DiscardCode&gt;B&lt;/DiscardCode&gt;
  &lt;Archive&gt;Arkivdel3&lt;/Archive&gt;
  &lt;JournalUnit&gt;JournEnh&lt;/JournalUnit&gt;
  &lt;JournalizingCode&gt;
    &lt;FieldValue&gt;00.01.00&lt;/FieldValue&gt;
    &lt;DisplayName&gt;00.01.00 - Kommunens styrelse i almindelighed&lt;/DisplayName&gt;
  &lt;/JournalizingCode&gt;
  &lt;Facet&gt;
    &lt;FieldValue&gt;A00&lt;/FieldValue&gt;
    &lt;DisplayName&gt;A00 - Organisering mv. i almindelighed&lt;/DisplayName&gt;
  &lt;/Facet&gt;
  &lt;DeletionCode&gt;P1800D&lt;/DeletionCode&gt;
&lt;/PublishedCase&gt;</Metadata><PhysicalFileReference xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo"><FileName xsi:nil="true" /><ItemId xsi:nil="true" /><Version xsi:nil="true" /></PhysicalFileReference></info></Publish></soap:Body></soap:Envelope>